RT-Thread/rt-thread/bsp/apm32/libraries/APM32F0xx_Library/APM32F0xx_StdPeriphDriver/src/apm32f0xx_rcm.c
#if defined (APM32F030) || defined (APM32F051)
/*!
 * @brief       Selects clock ouput source
 *
 * @param       cocClock:  specifies the clock source to output
 *                         This parameter can be one of the following values:
 *                         @arg RCM_COC_NO_CLOCK:     No clock selected.
 *                         @arg RCM_COC_HSI14:        HSI14 oscillator clock selected.
 *                         @arg RCM_COC_LSI:          LSI oscillator clock selected.
 *                         @arg RCM_COC_LSE:          LSE oscillator clock selected.
 *                         @arg RCM_COC_SYSCLK:       System clock selected.
 *                         @arg RCM_COC_HSI:          HSI oscillator clock selected.
 *                         @arg RCM_COC_HSE:          HSE oscillator clock selected.
 *                         @arg RCM_COC_PLLCLK_DIV_2: PLL clock divided by 2 selected.
 *
 * @retval      None
 */
void RCM_ConfigCOC(RCM_COCCLK_T cocClock)
{
    RCM->CFG1_B.MCOSEL = cocClock;
}
#else

/*!
 * @brief       Selects clock ouput source
 *
 * @param       cocClock:  specifies the clock source to output
 *                         This parameter can be one of the following values:
 *                         @arg RCM_COC_NO_CLOCK:     No clock selected.
 *                         @arg RCM_COC_HSI14:        HSI14 oscillator clock selected.
 *                         @arg RCM_COC_LSI:          LSI oscillator clock selected.
 *                         @arg RCM_COC_LSE:          LSE oscillator clock selected.
 *                         @arg RCM_COC_SYSCLK:       System clock selected.
 *                         @arg RCM_COC_HSI:          HSI oscillator clock selected.
 *                         @arg RCM_COC_HSE:          HSE oscillator clock selected.
 *                         @arg RCM_COC_PLLCLK_DIV_2: PLL clock divided by 2 selected.
 *                         @arg RCM_COC_PLLCLK:       PLL clock divided selected.
 *                         @arg RCM_COC_HSI48:        HSI48 oscillator clock selected.
 *
 * @param       divided:   specifies the prescaler on COC pin.
 *                         This parameter can only be the following value:
 *                         @arg RCM_COC_DIV_1:        MCOSEL clock is divided by 1.
 *                         @arg RCM_COC_DIV_2:        MCOSEL clock is divided by 2.
 *                         @arg RCM_COC_DIV_4:        MCOSEL clock is divided by 4.
 *                         @arg RCM_COC_DIV_8:        MCOSEL clock is divided by 8.
 *                         @arg RCM_COC_DIV_16:       MCOSEL clock is divided by 16.
 *                         @arg RCM_COC_DIV_32:       MCOSEL clock is divided by 32.
 *                         @arg RCM_COC_DIV_64:       MCOSEL clock is divided by 64.
 *                         @arg RCM_COC_DIV_128:      MCOSEL clock is divided by 128.
 *
 * @retval      None
 */
void RCM_ConfigCOC(RCM_COCCLK_T cocClock, RCM_COCPRE_T divided)
{
    RCM->CFG1_B.MCOPSC = divided;

    if (cocClock != RCM_COC_PLLCLK)
    {
        RCM->CFG1_B.MCOPLLPSC = BIT_RESET;
        RCM->CFG1_B.MCOSEL = cocClock;
    }
    else
    {
        RCM->CFG1_B.MCOPLLPSC = BIT_SET;
        RCM->CFG1_B.MCOSEL = 0x07;
    }
}
#endif /* APM32F072 */

/*!
 * @brief       Configures the system clock
 *
 * @param       sysClkSelect:   specifies the clock source used as system clock
 *                              This parameter can be one of the following values:
 *                              @arg RCM_SYSCLK_SEL_HSI:    HSI selected as system clock source
 *                              @arg RCM_SYSCLK_SEL_HSE:    HSE selected as system clock source
 *                              @arg RCM_SYSCLK_SEL_PLL:    PLL selected as system clock source
 *                              @arg RCM_SYSCLK_SEL_HSI48:  HSI48 selected as system clock source,It's only for 072 devices
 *
 * @retval      None
 */
void RCM_ConfigSYSCLK(RCM_SYSCLK_SEL_T sysClkSelect)
{
    RCM->CFG1_B.SCLKSEL = sysClkSelect;
}

/*!
 * @brief       returns the clock source used as system clock
 *
 * @param       None
 *
 * @retval      The clock source used as system clock
 */
RCM_SYSCLK_SEL_T RCM_ReadSYSCLKSource(void)
{
    RCM_SYSCLK_SEL_T sysClock;

    sysClock = (RCM_SYSCLK_SEL_T)RCM->CFG1_B.SCLKSWSTS;

    return sysClock;
}

/*!
 * @brief       Configures the AHB clock
 *
 * @param       AHBDiv:   AHB divider number. This clock is derived from the system clock (SYSCLK)
 *                        This parameter can be one of the following values:
 *                        @arg RCM_SYSCLK_DIV_1:   AHB clock = SYSCLK
 *                        @arg RCM_SYSCLK_DIV_2:   AHB clock = SYSCLK/2
 *                        @arg RCM_SYSCLK_DIV_4:   AHB clock = SYSCLK/4
 *                        @arg RCM_SYSCLK_DIV_8:   AHB clock = SYSCLK/8
 *                        @arg RCM_SYSCLK_DIV_16:  AHB clock = SYSCLK/16
 *                        @arg RCM_SYSCLK_DIV_64:  AHB clock = SYSCLK/64
 *                        @arg RCM_SYSCLK_DIV_128: AHB clock = SYSCLK/128
 *                        @arg RCM_SYSCLK_DIV_256: AHB clock = SYSCLK/256
 *                        @arg RCM_SYSCLK_DIV_512: AHB clock = SYSCLK/512
 *
 * @retval      None
 */
void RCM_ConfigAHB(RCM_AHBDIV_T AHBDiv)
{
    RCM->CFG1_B.AHBPSC = AHBDiv;
}

/*!
 * @brief       Configures the APB clock
 *
 * @param       APBDiv:   defines the APB clock divider. This clock is derived from the AHB clock (HCLK)
 *                        This parameter can be one of the following values:
 *                        @arg RCM_HCLK_DIV_1:  APB clock = HCLK
 *                        @arg RCM_HCLK_DIV_2:  APB clock = HCLK/2
 *                        @arg RCM_HCLK_DIV_4:  APB clock = HCLK/4
 *                        @arg RCM_HCLK_DIV_8:  APB clock = HCLK/8
 *                        @arg RCM_HCLK_DIV_16: APB clock = HCLK/16
 *
 * @retval      None
 */
void RCM_ConfigAPB(RCM_APBDIV_T APBDiv)
{
    RCM->CFG1_B.APB1PSC = APBDiv;
}

/*!
 * @brief       Configures the CEC clock
 *
 * @param       CECClk:   defines the CEC clock divider. This clock is derived
 *                        from the HSI/244 (32768Hz) clock or LSI clock
 *                        This parameter can be one of the following values:
 *                        @arg RCM_CECCLK_HSI_DIV_224: CEC clock = HSI/244 (32768Hz)
 *                        @arg RCM_CECCLK_LSI_DIV: CEC clock = LSI
 *
 * @retval      None
 */
void RCM_ConfigCECCLK(RCM_CECCLK_T CECClk)
{
    RCM->CFG3_B.CECSEL = CECClk;
}

/*!
 * @brief       Configures the I2C clock
 *
 * @param       I2CClk:   defines the I2C1 clock source. This clock is derived
 *                        from the HSI or System clock.
 *                        This parameter can be one of the following values:
 *                        @arg RCM_I2C1CLK_HSI:    I2C1 clock = HSI
 *                        @arg RCM_I2C1CLK_SYSCLK: I2C1 clock = System Clock
 *
 * @retval      None
 */
void RCM_ConfigI2CCLK(RCM_I2CCLK_T I2CClk)
{
    RCM->CFG3_B.I2C1SEL = I2CClk;
}

/*!
 * @brief       Configures the USART clock (USARTCLK)
 *
 * @param       USARTClk: defines the USART clock source. This clock is derived
 *                        from the HSI or System clock.
 *                        This parameter can be one of the following values:
 *                        @arg RCM_USART1CLK_PCLK:   USART1 clock = APB Clock (PCLK)
 *                        @arg RCM_USART1CLK_SYSCLK: USART1 clock = System Clock
 *                        @arg RCM_USART1CLK_LSE:    USART1 clock = LSE Clock
 *                        @arg RCM_USART1CLK_HSI:    USART1 clock = HSI Clock
 *                        Under it's only for APM32F072 and APM32F091 devices
 *                        @arg RCM_USART2CLK_PCLK:   USART2 clock = APB Clock (PCLK)
 *                        @arg RCM_USART2CLK_SYSCLK: USART2 clock = System Clock
 *                        @arg RCM_USART2CLK_LSE:    USART2 clock = LSE Clock
 *                        @arg RCM_USART2CLK_HSI:    USART2 clock = HSI Clock
 *                        Under it's only for APM32F091 devices
 *                        @arg RCM_USART3CLK_PCLK:   USART3 clock = APB Clock (PCLK)
 *                        @arg RCM_USART3CLK_SYSCLK: USART3 clock = System Clock
 *                        @arg RCM_USART3CLK_LSE:    USART3 clock = LSE Clock
 *                        @arg RCM_USART3CLK_HSI:    USART3 clock = HSI Clock
 *
 * @retval      None
 */
void RCM_ConfigUSARTCLK(RCM_USARTCLK_T USARTClk)
{
    if (USARTClk >> 16 == 1)
    {
        RCM->CFG3_B.USART1SEL = (uint32_t)(USARTClk & 0x00000003);
    }
    else if (USARTClk >> 17 == 1)
    {
        RCM->CFG3_B.USART2SEL = (uint32_t)(USARTClk & 0x00000003);
    }
    else
    {
        RCM->CFG3_B.USART3SEL = (uint32_t)(USARTClk & 0x00000003);
    }
}

/*!
 * @brief       Configures the USB clock (USBCLK)
 *
 * @param       USBClk: defines the USB clock source. This clock is derived
 *                      from the HSI48 or System clock.
 *                      This parameter can be one of the following values:
 *                      @arg RCM_USBCLK_HSI48:  USB clock = HSI48
 *                      @arg RCM_USBCLK_PLLCLK: USB clock = PLL Clock
 *
 * @retval      None
 *
 * @note        It's only for APM32F072 devices
 */
void RCM_ConfigUSBCLK(RCM_USBCLK_T USBClk)
{
    RCM->CFG3_B.USBDSEL = USBClk;
}

/*!
 * @brief       Read frequency of SYSCLK
 *
 * @param       None
 *
 * @retval      Return frequency of SYSCLK
 */
uint32_t RCM_ReadSYSCLKFreq(void)
{
    uint32_t sysClock, pllMull, plldiv, pllSource;

    sysClock = RCM->CFG1_B.SCLKSEL;

    switch (sysClock)
    {
        case RCM_SYSCLK_SEL_HSI:
            sysClock = HSI_VALUE;
            break;

        case RCM_SYSCLK_SEL_HSE:
            sysClock = HSE_VALUE;
            break;

        case RCM_SYSCLK_SEL_PLL:
            pllMull = RCM->CFG1_B.PLLMULCFG + 2;
            pllSource = RCM->CFG1_B.PLLSRCSEL;
            plldiv = RCM->CFG2_B.PLLDIVCFG + 1;

            if (pllSource == 0x00)
            {
                sysClock = ((HSI_VALUE >> 1) / plldiv) * pllMull;
            }
            else if (pllSource == 0x01)
            {
                sysClock = (HSI_VALUE / plldiv) * pllMull;
            }
            else if (pllSource == 0x02)
            {
                sysClock = (HSE_VALUE / plldiv) * pllMull;
            }
            else
            {
                sysClock = (HSI48_VALUE / plldiv) * pllMull;
            }
            break;

        case RCM_SYSCLK_SEL_HSI48:
            sysClock  = HSI48_VALUE;
            break;

        default:
            sysClock  = HSI_VALUE;
            break;
    }

